[
  {
    "date": "2018-12-03",
    "title": "Release of Old Town Road",
    "summary": "\"Old Town Road\" is the debut mainstream single by the American rapper and singer Lil Nas X, first released independently in December 2018. After gaining popularity, the single was re-released by Columbia Records in March 2019. He also recorded a remix with American country singer Billy Ray Cyrus, which was released on the 5th of April, 2019. Both were included on Lil Nas X's second studio extended play (EP), 7 (2019).",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/1c/Old_Town_Road_cover.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Old_Town_Road?wprov=sfla1"
  },
  {
    "date": "2024-04-12",
    "title": "Release of A Bar Song (Tipsy)",
    "summary": "\"A Bar Song (Tipsy)\" is a song by American musician Shaboozey. The song was released April 12, 2024, as the fourth single from his third album Where I've Been, Isn't Where I'm Going. \"A Bar Song (Tipsy)\" tied \"Old Town Road\" by Lil Nas X as the longest-running number-one song of all time on the Billboard Hot 100 with 19 non-consecutive weeks at the top of the chart, and the longest by a solo artist. Outside of the United States, \"A Bar Song (Tipsy)\" topped the charts in Australia, Belgium (Flanders), Canada, Ireland, Norway, and Sweden, and peaked within the top ten of the charts in Austria, Belgium (Wallonia), Denmark, Iceland, the Netherlands, New Zealand, South Africa, Switzerland, and the United Kingdom.",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/26/Shaboozey_-_A_Bar_Song_%28Tipsy%29.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/A_Bar_Song_%28Tipsy%29?wprov=sfla1"
  },
  {
    "date": "2014-11-10",
    "title": "Release of Uptown Funk",
    "summary": "\"Uptown Funk\" is a song by British record producer Mark Ronson featuring American singer Bruno Mars. It was released on 10 November 2014, as the lead single from Ronson's fourth studio album, Uptown Special (2015). \"Uptown Funk\" was written by Ronson, Mars, Jeff Bhasker, and Philip Lawrence; it was produced by the aforementioned first three. The song began during a freestyle studio session while they worked on a jam Mars and his band had been playing on tour. Copyright controversies arose after the song's release resulting in multiple lawsuits and amendments to its songwriting credits.",
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a7/Mark_Ronson_-_Uptown_Funk_%28feat._Bruno_Mars%29_%28Official_Single_Cover%29.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Uptown_Funk?wprov=sfla1"
  },
  {
    "date": "1972-08-04",
    "title": "Release of Ben (Michael Jackson album)",
    "summary": "Ben is the second studio album by the American singer Michael Jackson, released by Motown Records on August 4, 1972, while Jackson was still a member of the Jackson 5. It received mixed reviews from contemporary music critics. Ben, however, was more successful on the music charts than Jackson's previous studio album, peaking within the top 10 on the Billboard 200 in the United States. Internationally, the album was less successful, peaking at number 12 in Canada, while charting within the top 200 positions in Australia and France.",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/17/BenMichaelJackson.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Ben_%28Michael_Jackson_album%29?wprov=sfla1"
  },
  {
    "date": "1979-08-10",
    "title": "Release of Off the Wall",
    "summary": "Off the Wall is the fifth studio album by the American singer Michael Jackson, released on August 10, 1979, by Epic Records. It was Jackson's first album released through Epic Records, and the first produced by Quincy Jones, whom he met while working on the 1978 film The Wiz. Several critics observed that Off the Wall was crafted from disco, pop, funk, R&B, soft rock and Broadway ballads. Its lyrical themes include escapism, liberty, loneliness, hedonism and romance. The album features songwriting contributions from Stevie Wonder, Paul McCartney, Rod Temperton, Tom Bahler, and David Foster, alongside three tracks penned by Jackson himself.",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/f6/Off_the_wall.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Off_the_Wall?wprov=sfla1"
  },
  {
    "date": "1978-01-01",
    "title": "Release of Don't Stop 'Til You Get Enough",
    "summary": "\"Don't Stop 'Til You Get Enough\" is a song by the American singer-songwriter Michael Jackson. Written by Jackson and released by Epic Records on July 10, 1979, the song is the first track on Jackson's fifth studio album, Off the Wall (1979). Additionally, it was Jackson's first solo recording in which he had control of the creative direction.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Dont_stop_til_you_get_enough_michael_jackson_UK_7-inch_solid_centre.png/330px-Dont_stop_til_you_get_enough_michael_jackson_UK_7-inch_solid_centre.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Don%27t_Stop_%27Til_You_Get_Enough?wprov=sfla1"
  },
  {
    "date": "1982-11-30",
    "title": "Release of Thriller (album)",
    "summary": "Thriller is the sixth studio album by the American singer and songwriter Michael Jackson, released on November 29, 1982, by Epic Records. It was produced by Quincy Jones, who previously worked with Jackson on his album Off the Wall (1979). With the ongoing backlash against disco music at the time, he moved in a new musical direction, resulting in a mix of pop, post-disco, rock, funk, synth-pop, and R&B sounds, and darker themes; Jackson wanted to create an album where \"every song was a killer\". Paul McCartney appears as the first credited featured artist on a Jackson album. Recording took place from April to November 1982 at Westlake Recording Studios in Los Angeles, California, with a budget of $750,000.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/55/Michael_Jackson_-_Thriller.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Thriller_%28album%29?wprov=sfla1"
  },
  {
    "date": "1982-01-01",
    "title": "Release of Thriller (song)",
    "summary": "\"Thriller\" is a song by American singer Michael Jackson. It was released by Epic Records on November 11, 1983 in the United Kingdom and on January 23, 1984, in the United States, as the seventh and final single from his sixth studio album Thriller.",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/89/Michael_jackson_thriller_12_inch_single_USA.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Thriller_%28song%29?wprov=sfla1"
  },
  {
    "date": "1983-02-01",
    "title": "Release of Beat It",
    "summary": "\"Beat It\" is a song by American singer Michael Jackson from his sixth studio album, Thriller (1982). It was written and composed by Jackson, produced by Quincy Jones, and co-produced by Jackson. Jones encouraged Jackson to include a rock song on the album. Jackson later said: \"I wanted to write a song, the type of song that I would buy if I were to buy a rock song... and I wanted the children to really enjoy it—the school children as well as the college students.\" It includes a guitar solo by Eddie Van Halen.",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/82/Beat_It.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Beat_It?wprov=sfla1"
  },
  {
    "date": "1982-01-01",
    "title": "Release of Billie Jean",
    "summary": "\"Billie Jean\" is a song by the American singer Michael Jackson, released by Epic Records on January 3, 1983, as the second single from his sixth studio album, Thriller (1982). It was written and composed by Jackson, produced by Quincy Jones, and co-produced by Jackson. \"Billie Jean\" blends post-disco, R&B, funk, and dance-pop. The lyrics describe a young woman, Billie Jean, who claims that the narrator is the father of her newborn son, which he denies. Jackson said the lyrics were based on groupies' claims about his older brothers when he toured with them as the Jackson 5.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/d6/Billie_Jean_US_7-inch_vinyl_Side-A.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Billie_Jean?wprov=sfla1"
  },
  {
    "date": "1987-08-31",
    "title": "Release of Bad (album)",
    "summary": "Bad is the seventh studio album by American singer-songwriter Michael Jackson. It was released on August 31, 1987, by Epic Records. Jackson adopted a more assertive sound on the album, moving away from his trademark groove-based style and falsetto. Primarily a pop, dance, and R&B album with elements of funk, soul, jazz, and rock, Bad embraced new recording technology, including digital synthesizers. With guest appearances from Siedah Garrett and Stevie Wonder, Jackson co-produced the album and wrote all but two tracks. Its lyrical themes comprise self-improvement, romance, world peace, media bias, paranoia, and racial profiling.",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/51/Michael_Jackson_-_Bad.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Bad_%28album%29?wprov=sfla1"
  },
  {
    "date": "1987-01-01",
    "title": "Release of Bad (Michael Jackson song)",
    "summary": "\"Bad\" is a song by the American singer Michael Jackson. It was released by Epic Records on September 7, 1987, as the second single from his studio album of the same name. The song was written and composed by Jackson, and produced by Jackson and Quincy Jones. It was influenced by a true story Jackson read about a young man who tried to escape poverty by attending private school but was killed upon returning home.",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/12/Michael_Jackson_-_Bad.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Bad_%28Michael_Jackson_song%29?wprov=sfla1"
  },
  {
    "date": "1987-01-01",
    "title": "Release of Smooth Criminal",
    "summary": "\"Smooth Criminal\" is a song by the American singer Michael Jackson, released on November 14, 1988, as the seventh single from his seventh studio album, Bad (1987). It was written by Jackson and produced by Jackson and Quincy Jones. The lyrics describe a woman who has been attacked in her apartment and the search for the attacker, who is \"smooth\" because he leaves no evidence as to his identity.",
    "image": "https://upload.wikimedia.org/wikipedia/en/3/33/Smooth_Criminal.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Smooth_Criminal?wprov=sfla1"
  },
  {
    "date": "1987-01-01",
    "title": "Release of Dirty Diana",
    "summary": "\"Dirty Diana\" is a song by American singer-songwriter Michael Jackson. It is the ninth track on Jackson's seventh studio album, Bad (1987). The song was released by Epic Records on April 18, 1988, as the fifth single from the album. It presents a harder rock sound similar to \"Beat It\" from Thriller (1982) and a guitar solo played by Steve Stevens. \"Dirty Diana\" was written and co-produced by Jackson, and produced by Quincy Jones. The song's lyrics pertain to groupies.",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/cf/Michael_Jackson_-_Dirty_Diana.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Dirty_Diana?wprov=sfla1"
  },
  {
    "date": "1987-01-01",
    "title": "Release of Man in the Mirror",
    "summary": "\"Man in the Mirror\" is a song by the American singer Michael Jackson. It was written by Glen Ballard and Siedah Garrett and produced by Jackson and Quincy Jones. It was released in January 1988 as the fourth single from Jackson's seventh solo album, Bad (1987).",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c9/Michael_Jackson_-_Man_in_the_Mirror.png",
    "wikiUrl": "https://en.wikipedia.org/wiki/Man_in_the_Mirror?wprov=sfla1"
  },
  {
    "date": "1958-08-29",
    "title": "Birth of Michael Jackson",
    "summary": "Michael Joseph Jackson was an American singer, songwriter, dancer, and philanthropist. Dubbed the \"King of Pop\", he is widely regarded as one of the most culturally significant figures of the 20th century. Over a four-decade career, his music achievements broke racial barriers in America and made him a dominant figure worldwide. Through his songs, stages, and fashion, he proliferated visual performance for artists in popular music, popularizing street dance moves such as the moonwalk, the robot and the anti-gravity lean. Jackson is often deemed the greatest entertainer of all time based on his acclaim and records.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Michael_Jackson_1983_%283x4_cropped%29_%28contrast%29.jpg/330px-Michael_Jackson_1983_%283x4_cropped%29_%28contrast%29.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Michael_Jackson?wprov=sfla1"
  },
  {
    "date": "2009-06-25",
    "title": "Death of Michael Jackson",
    "summary": "Michael Joseph Jackson was an American singer, songwriter, dancer, and philanthropist. Dubbed the \"King of Pop\", he is widely regarded as one of the most culturally significant figures of the 20th century. Over a four-decade career, his music achievements broke racial barriers in America and made him a dominant figure worldwide. Through his songs, stages, and fashion, he proliferated visual performance for artists in popular music, popularizing street dance moves such as the moonwalk, the robot and the anti-gravity lean. Jackson is often deemed the greatest entertainer of all time based on his acclaim and records.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Michael_Jackson_1983_%283x4_cropped%29_%28contrast%29.jpg/330px-Michael_Jackson_1983_%283x4_cropped%29_%28contrast%29.jpg",
    "wikiUrl": "https://en.wikipedia.org/wiki/Michael_Jackson?wprov=sfla1"
  }
]